
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		ОбщийДокументы.НачальноеЗаполнение ( Объект );
	Иначе
		// код ...	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриНачалеРедактирования ( Элемент, НоваяСтрока, Копирование )
	
	Если ( НоваяСтрока ) Тогда
		Элементы.Услуги.ТекущиеДанные.Количество = 1;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении ( Элемент )
	
	ОбщийДокументы.РассчитатьСумму ( Элементы.Услуги.ТекущиеДанные );
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении ( Элемент )
	
	ОбщийДокументы.РассчитатьСумму ( Элементы.Услуги.ТекущиеДанные );	
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаПриИзменении ( Элемент )
	
	ОбщийДокументы.РассчитатьЦену ( Элементы.Услуги.ТекущиеДанные );	
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении ( Элемент )
	
	Объект.Пост = ПолучитьГоловногоКонтрагента ( Объект.Контрагент );
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьГоловногоКонтрагента ( Контрагент )
	
	пост = Справочники.Контрагенты.ПустаяСсылка ();
	Если ( ЗначениеЗаполнено ( Контрагент ) ) Тогда
		пост = Контрагент.ГоловнойКонтрагент;
	КонецЕсли; 
	Возврат пост;

КонецФункции 
