
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		ОбщийДокументы.НачальноеЗаполнение ( Объект );
		Объект.ДатаОперации = ТекущаяДата ();
	Иначе
		// код ...	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении ( Элемент )
	
	установитьВидимостьРеквизитов ();	
	
КонецПроцедуры

&НаКлиенте
Процедура установитьВидимостьРеквизитов ()
	
	Элементы.Касса.Видимость = ( Объект.ВидОперации = ПредопределенноеЗначение ( "Перечисление.ВидОперацииАвансовогоОтчета.Возврат" ) );
	Элементы.Организация.Видимость = ( Объект.ВидОперации = ПредопределенноеЗначение ( "Перечисление.ВидОперацииАвансовогоОтчета.Возврат" ) );
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии ( Отказ )
	
	установитьВидимостьРеквизитов ();	
	
КонецПроцедуры