
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Контрагент = Справочники.Контрагенты.НайтиПоКоду ( "000001366" );
	СтатьяДДС = Справочники.СтатьяДДС.НайтиПоКоду ( "000000016" );
	КассаКуда = Справочники.Кассы.НайтиПоКоду ( "000000004" );
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыПрихода ( Команда )
	
	ПоказатьВопрос ( Новый ОписаниеОповещения ( "ВопросСоздатьДокументыПрихода", ЭтотОбъект ), "Создать приходы в кассу?", РежимДиалогаВопрос.ДаНет ); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСоздатьДокументыПрихода ( Ответ, Парамы ) Экспорт
	
	Если ( Ответ = КодВозвратаДиалога.Да ) Тогда
		создатьПриходыНаСервере ();
		ПоказатьПредупреждение ( , "Документы созданы!" );
	КонецЕсли; 
	
КонецПроцедуры 

&НаСервере
Процедура создатьПриходыНаСервере ()
	
	с = "
	|выбрать
	|	Ссылка как Ссылка
	|из
	|	Документ.РасходныйКассовыйОрдер
	|где
	|	Проведен 
	|	и Дата между &ДатаНачала и &ДатаОкончания
	|	и Контрагент = &Контрагент
	|	и СтатьяДДС = &СтатьяДДС  
	|";
	запрос = Новый Запрос ( с );
	запрос.УстановитьПараметр ( "ДатаНачала", Период.ДатаНачала );
	запрос.УстановитьПараметр ( "ДатаОкончания", Период.ДатаОкончания );
	запрос.УстановитьПараметр ( "Контрагент", Контрагент );
	запрос.УстановитьПараметр ( "СтатьяДДС", СтатьяДДС );
	результат = запрос.Выполнить ();
	выборка = результат.Выбрать ();
	Пока ( выборка.Следующий () ) Цикл
		приход = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент ();
		приход.Заполнить ( выборка.Ссылка );
		приход.Касса = КассаКуда;
		приход.Контрагент = Контрагент;
		приход.СтатьяДДС = СтатьяДДС;
		приход.Записать ( РежимЗаписиДокумента.Проведение );
		рко = выборка.Ссылка.ПолучитьОбъект ();
		рко.ДокументПКО = приход.Ссылка;
		рко.Записать ( РежимЗаписиДокумента.Проведение );		
	КонецЦикла; 

КонецПроцедуры