
Процедура ПередЗаписью ( Отказ, РежимЗаписи, РежимПроведения )
	
	Если ( ОбменДанными.Загрузка ) Тогда
		Возврат;
	КонецЕсли;
	заполнитьШапку ();
	
КонецПроцедуры

Процедура заполнитьШапку ()
	
	Количество = 0;
	КоличествоТранспорта = 0;
	СуммаПоДокументу = 0;
	ТранспортСтрокой = "";
	Для Каждого строкаТЧ Из Транспорт Цикл
		Количество = Количество + строкаТЧ.Вес;
		КоличествоТранспорта = КоличествоТранспорта + 1;
		СуммаПоДокументу = СуммаПоДокументу + ЦенаДоллар;
		ТранспортСтрокой = ТранспортСтрокой + ? ( ТранспортСтрокой = "", "", ", " ) + строкаТЧ.Транспорт;	
	КонецЦикла;
	
КонецПроцедуры 

Процедура заполнитьДополнительныеСвойства ()
	
	ДополнительныеСвойства.Вставить ( "Перепроведение", Проведен );
	ДополнительныеСвойства.Вставить ( "ОперативноеПроведение", ( ЭтоНовый () И НачалоДня ( Дата ) = НачалоДня ( ТекущаяДата () ) ) ); 
	
КонецПроцедуры 

Процедура ОбработкаПроведения ( Отказ, РежимПроведения )
	
	заполнитьДополнительныеСвойства	();
	данные = Новый Структура;
	данные.Вставить ( "Ссылка", Ссылка );
	данные.Вставить ( "Дата", Дата );
	данные.Вставить ( "Движения", Движения );
	данные.Вставить ( "МоментВремени", МоментВремени () );
	данные.Вставить ( "ДополнительныеСвойства", ДополнительныеСвойства );
	Отказ = НЕ Документы.Заявка.Проведение ( данные );
	
КонецПроцедуры