
Функция Проведение ( Данные ) Экспорт
	
	получитьДанныеДокумента ( Данные );
	сформироватьДенежныеСредства ( Данные );
	сформироватьДвиженияДенежныхСредств ( Данные );
	установитьФлагиЗаписи ( Данные );
	Возврат ИСТИНА;
	
КонецФункции

Процедура получитьДанныеДокумента ( Данные )
	
	текст = "
	|// ~Шапка
	|выбрать
	|	Дата как Период, КассаОткуда как КассаОткуда, КассаОткуда.Валюта как ВалютаОткуда,
	|	КассаКуда как КассаКуда, КассаКуда.Валюта как ВалютаКуда, СуммаОткуда как СуммаОткуда,
	|	СуммаКуда как СуммаКуда, СтатьяДДС как СтатьяДДС 
	|из Документ.ПеремещениеДенежныхСредств
	|где Ссылка = &Ссылка
	|";
	запрос = Новый Запрос ( текст );
	запрос.УстановитьПараметр ( "Ссылка", Данные.Ссылка );
	результат = запрос.Выполнить ();
	выборкаШапка = результат.Выбрать ();
	выборкаШапка.Следующий ();
	Данные.Вставить ( "Шапка", выборкаШапка );

КонецПроцедуры

Процедура сформироватьДенежныеСредства ( Данные )
	
	движение = Данные.Движения.ДенежныеСредства.ДобавитьРасход ();
	движение.Период = Данные.Шапка.Период;
	движение.Казна = Данные.Шапка.КассаОткуда;
	движение.Валюта = Данные.Шапка.ВалютаОткуда;
	движение.Сумма = Данные.Шапка.СуммаОткуда;
	движение = Данные.Движения.ДенежныеСредства.ДобавитьПриход ();
	движение.Период = Данные.Шапка.Период;
	движение.Казна = Данные.Шапка.КассаКуда;
	движение.Валюта = Данные.Шапка.ВалютаКуда;
	движение.Сумма = Данные.Шапка.СуммаКуда;
	
КонецПроцедуры

Процедура сформироватьДвиженияДенежныхСредств ( Данные )
	
	движение = Данные.Движения.ДвиженияДенежныхСредств.Добавить ();
	движение.Период = Данные.Шапка.Период;
	движение.Казна = Данные.Шапка.КассаОткуда;
	движение.Валюта = Данные.Шапка.ВалютаОткуда;
	движение.Организация = Данные.Шапка.Организация;
	движение.СтатьяДДС = Данные.Шапка.СтатьяДДС;
	движение.СуммаПриход = 0;
	движение.СуммаРасход = Данные.Шапка.СуммаОткуда;
	движение = Данные.Движения.ДвиженияДенежныхСредств.Добавить ();
	движение.Период = Данные.Шапка.Период;
	движение.Казна = Данные.Шапка.КассаКуда;
	движение.Валюта = Данные.Шапка.ВалютаКуда;
	движение.Организация = Данные.Шапка.Организация;
	движение.СтатьяДДС = Данные.Шапка.СтатьяДДС;
	движение.СуммаПриход = Данные.Шапка.СуммаКуда;
	движение.СуммаРасход = 0;
	
КонецПроцедуры

Процедура установитьФлагиЗаписи ( Данные )
	
	Данные.Движения.ДенежныеСредства.Записывать = ИСТИНА;
	Данные.Движения.ДвиженияДенежныхСредств.Записывать = ИСТИНА;
	
КонецПроцедуры