
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		ОбщийДокументы.НачальноеЗаполнение ( Объект );
		Объект.Статус = Перечисления.СтатусыКонтроль.Новая; 
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПоЗапросу ( Команда )
	
	Если ( ЗначениеЗаполнено ( Объект.ЗапросКлиента ) ) Тогда
		ПоказатьВопрос ( Новый ОписаниеОповещения ( "ВопросОбновитьДанные", ЭтотОбъект ), "Обновить данные из запроса клиента?", РежимДиалогаВопрос.ДаНет );
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросОбновитьДанные ( Ответ, Парамы ) Экспорт
	
	Если ( Ответ = КодВозвратаДиалога.Да ) Тогда
		заполнитьПоЗапросуКлиента ();
		Модифицированность = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура заполнитьПоЗапросуКлиента ()
	
	с = "
	|выбрать
	|	Контрагент как Контрагент,
	| 	Организация как Организация,
	|	ПакингЛист как ПакингЛист,
	|	Количество как Количество 
	|из
	|	Документ.ЗапросКлиента
	|где
	|	Ссылка = &Ссылка  
	|";
	запрос = Новый Запрос ( с );
	запрос.УстановитьПараметр ( "Ссылка", Объект.ЗапросКлиента );
	результат = запрос.Выполнить ();
	выборка = результат.Выбрать ();
	Пока ( выборка.Следующий () ) Цикл
		Объект.Контрагент = выборка.Контрагент;
		Объект.Организация = выборка.Организация;
		Объект.ПакингЛист = выборка.ПакингЛист;
		Объект.ВесПЛ = выборка.Количество;
	КонецЦикла;
	
КонецПроцедуры 