
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		начальноеЗаполнение ();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура начальноеЗаполнение ()
	
	Объект.СтатусЗаявки = Перечисления.СтатусыЗаявок.Новая;
	Объект.Валюта = Справочники.Валюты.Гривна;
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Объект.ДатаЗаявки = ТекущаяДата ();
	сотрудник = ОбщийДокументы.ПолучитьСотрудникаПользователя ( Объект.Ответственный );
	Объект.Заявитель = сотрудник;
	Объект.Получатель = сотрудник;  
	
КонецПроцедуры 