
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		начальноеЗаполнение ();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура начальноеЗаполнение ()
	
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Объект.Организация = Константы.ОсновнаяОрганизация.Получить (); 
	Объект.ВалютаИз = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" );
	Объект.ВалютаВ = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" );
	курсы = ОбщийДокументы.ПолучитьКурс ( ТекущаяДата (), ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) );
	Объект.Курс = курсы.Курс;	
	
КонецПроцедуры 

&НаКлиенте
Процедура ВалютаИзПриИзменении ( Элемент )
	
	рассчитатьСуммуПоКурсу ();	
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении ( Элемент )
	
	рассчитатьСуммуПоКурсу ();	
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаВПриИзменении ( Элемент )
	
	рассчитатьСумму ();	
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПоКурсуПриИзменении ( Элемент )
	
	рассчитатьСумму ();	
	
КонецПроцедуры

&НаКлиенте
Процедура КурсПриИзменении ( Элемент )
	
	рассчитатьСуммуПоКурсу ();	
	
КонецПроцедуры

&НаКлиенте
Процедура рассчитатьСуммуПоКурсу ()
	
	Если ( Объект.Курс = 0 ) Тогда
		Сообщить ( "Не указан курс!", СтатусСообщения.Важное );   		
		Объект.СуммаПоКурсу = 0; 
		Возврат;
	КонецЕсли;
	Если ( Объект.ВалютаИз = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) И Объект.ВалютаВ = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) ) Тогда
		к = 1 / Объект.Курс; 
	ИначеЕсли ( Объект.ВалютаИз = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) И Объект.ВалютаВ = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) ) Тогда
		к = 1;
	ИначеЕсли ( Объект.ВалютаИз = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) И Объект.ВалютаВ = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) ) Тогда
		к = 1;
	ИначеЕсли ( Объект.ВалютаИз = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) И Объект.ВалютаВ = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) ) Тогда
		к = Объект.Курс; 
	КонецЕсли; 	
	Объект.СуммаПоКурсу = Объект.Сумма * к;  
	
КонецПроцедуры

&НаКлиенте
Процедура рассчитатьСумму ()
	
	Если ( Объект.Курс = 0 ) Тогда
		Сообщить ( "Не указан курс!", СтатусСообщения.Важное );   		
		Объект.Сумма = 0; 
		Возврат;
	КонецЕсли;
	Если ( Объект.ВалютаВ = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) И Объект.ВалютаИз = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) ) Тогда
		к = 1 / Объект.Курс; 
	ИначеЕсли ( Объект.ВалютаВ = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) И Объект.ВалютаИз = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) ) Тогда
		к = 1;
	ИначеЕсли ( Объект.ВалютаВ = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) И Объект.ВалютаИз = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) ) Тогда
		к = 1;
	ИначеЕсли ( Объект.ВалютаВ = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) И Объект.ВалютаИз = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) ) Тогда
		к = Объект.Курс; 
	КонецЕсли; 	
	Объект.Сумма = Объект.СуммаПоКурсу * к;
	
КонецПроцедуры