
Процедура ПередЗаписью ( Отказ, РежимЗаписи, РежимПроведения )
	
	Если ( ОбменДанными.Загрузка ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура заполнитьДополнительныеСвойства ()
	
	ДополнительныеСвойства.Вставить ( "Перепроведение", Проведен );
	ДополнительныеСвойства.Вставить ( "ОперативноеПроведение", ( ЭтоНовый () И НачалоДня ( Дата ) = НачалоДня ( ТекущаяДата () ) ) ); 
	
КонецПроцедуры 

Процедура ОбработкаПроведения ( Отказ, РежимПроведения )
	
	заполнитьДополнительныеСвойства	();
	данные = Новый Структура;
	данные.Вставить ( "Ссылка", Ссылка );
	данные.Вставить ( "Дата", Дата );
	данные.Вставить ( "Движения", Движения );
	данные.Вставить ( "МоментВремени", МоментВремени () );
	данные.Вставить ( "ДополнительныеСвойства", ДополнительныеСвойства );
	Отказ = НЕ Документы.ПлатежноеПоручениеИсходящее.Проведение ( данные );
	
КонецПроцедуры

Процедура ОбработкаЗаполнения ( ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка )
	
	Если ( ТипЗнч ( ДанныеЗаполнения ) = Тип ( "ДокументСсылка.ГТД" ) ) Тогда
		заполнитьПоГТД ( ДанныеЗаполнения );
	КонецЕсли; 
	
КонецПроцедуры

Процедура заполнитьПоГТД  ( ДанныеЗаполнения )
	
	данные = получитьДанныеГТД ( ДанныеЗаполнения );
	Сумма = данные.Сумма;
	СуммаПлатежа = данные.Сумма;
	Контрагент = данные.Контрагент;
	ГТД = данные.ГТД;
	Организация = данные.Организация;	
	ДатаОперации = ТекущаяДата ();
	
КонецПроцедуры 

Функция получитьДанныеГТД ( ГТД )
	
	с = "
	|выбрать
	|	сумма ( естьnull ( ТЧТранспорт.Цена, 0 ) ) как Сумма,
	|	ДокГТД.Контрагент как Контрагент, ДокГТД.Ссылка как ГТД,
	|	ДокГТД.Организация как Организация
	|из
	|	Документ.ГТД как ДокГТД
	|	левое соединение Документ.ГТД.Транспорт как ТЧТранспорт
	|	по ТЧТранспорт.Ссылка = &ГТД  
	|где
	|	ДокГТД.Ссылка = &ГТД
	|сгруппировать по
	|	ДокГТД.Ссылка 
	|";
	запрос = Новый Запрос ( с );
	запрос.УстановитьПараметр ( "ГТД", ГТД );
	результат = запрос.Выполнить ();
	выборка = результат.Выбрать ();
	выборка.Следующий ();	
	Возврат выборка;

КонецФункции