
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		начальноеЗаполнение ();
		ОбщийДокументы.НачальноеЗаполнение ( Объект );
 	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура начальноеЗаполнение ()
	
	ОбщийДокументы.НачальноеЗаполнение ( Объект );
	// Объект.Курс = получитьКурс ( Объект.ДатаГТД, Объект.Валюта );
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция получитьКурс ( Период, Валюта )
	
	курсы = ОбщийДокументы.ПолучитьКурс ( ? ( ЗначениеЗаполнено ( Период ), Период, ТекущаяДата () ), Валюта );
	Возврат курсы.Курс;

КонецФункции  

&НаКлиенте
Процедура ДатаГТДПриИзменении ( Элемент )
	
	Объект.Курс = получитьКурс ( Объект.ДатаГТД, Объект.Валюта );   
	
КонецПроцедуры

&НаКлиенте
Процедура КурсПриИзменении ( Элемент )
	
	рассчитатьСуммаГТД ();
	
КонецПроцедуры

&НаКлиенте
Процедура рассчитатьСуммаПлатежа ()
	
	данные = Элементы.Транспорт.ТекущиеДанные;
	Если ( данные <> Неопределено ) Тогда
		данные.СуммаПлатежа = данные.СуммаСтрока020 + данные.СуммаСтрока028;   	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура рассчитатьСуммаГТД ()
	
	данные = Элементы.Транспорт.ТекущиеДанные;
	Если ( данные <> Неопределено ) Тогда
		данные.СуммаПлатежа = данные.СуммаСтрока020 + данные.СуммаСтрока028;   	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортСуммаСтрока020ПриИзменении ( Элемент )
	
	рассчитатьСуммаПлатежа ();
	рассчитатьСуммаГТД ();	
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортСуммаСтрока028ПриИзменении ( Элемент )
	
	рассчитатьСуммаПлатежа ();
	рассчитатьСуммаГТД ();
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортСуммаИнвойсаПриИзменении ( Элемент )
	
	рассчитатьСуммаГТД ();
	
КонецПроцедуры