
Процедура ПередЗаписью ( Отказ, РежимЗаписи, РежимПроведения )
	
	Если ( ОбменДанными.Загрузка ) Тогда
		Возврат;
	КонецЕсли;
	КоличествоТранспорта = Транспорт.Количество ();
	
КонецПроцедуры

Процедура заполнитьДополнительныеСвойства ()
	
	ДополнительныеСвойства.Вставить ( "Перепроведение", Проведен );
	ДополнительныеСвойства.Вставить ( "ОперативноеПроведение", ( ЭтоНовый () И НачалоДня ( Дата ) = НачалоДня ( ТекущаяДата () ) ) ); 
	
КонецПроцедуры 

Процедура ОбработкаПроведения ( Отказ, РежимПроведения )
	
	заполнитьДополнительныеСвойства	();
	данные = Новый Структура;
	данные.Вставить ( "Ссылка", Ссылка );
	данные.Вставить ( "Дата", Дата );
	данные.Вставить ( "Движения", Движения );
	данные.Вставить ( "МоментВремени", МоментВремени () );
	данные.Вставить ( "ДополнительныеСвойства", ДополнительныеСвойства );
	Отказ = НЕ Документы.БрокерскиеУслуги.Проведение ( данные );
	
КонецПроцедуры

Процедура ОбработкаЗаполнения ( ДанныеЗаполнения, СтандартнаяОбработка ) Экспорт 
	
	Если ТипЗнч ( ДанныеЗаполнения ) = Тип ( "ДокументСсылка.Контроль" ) Тогда
		заполнитьПоКонтролю ( ДанныеЗаполнения );
	КонецЕсли;
	
КонецПроцедуры

Процедура заполнитьПоКонтролю ( Данные )
	
	Контроль = Данные.Ссылка;
	с = "
	|выбрать
	|	Дата как Дата,
	|	Контрагент как Контрагент,
	| 	Организация как Организация,
	|	Транспорт как Транспорт,
	|	Номенклатура как Номенклатура
	|из
	|	Документ.Контроль
	|где
	|	Ссылка = &Ссылка  
	|";
	запрос = Новый Запрос ( с );
	запрос.УстановитьПараметр ( "Ссылка", Данные.Ссылка );
	результат = запрос.Выполнить ();
	выборка = результат.Выбрать ();
	Транспорт.Очистить ();
	КоличествоТранспорта = 1;
	Пока ( выборка.Следующий () ) Цикл
		новаяСтрока = Транспорт.Добавить ();
		новаяСтрока.Контрагент = выборка.Контрагент;
		новаяСтрока.Номенклатура = выборка.Номенклатура;
		новаяСтрока.Организация = выборка.Организация;
		новаяСтрока.Транспорт = выборка.Транспорт;
		новаяСтрока.Дата = выборка.Дата;
		Организация = выборка.Организация;
	КонецЦикла; 
	
КонецПроцедуры