
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	// код ...
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВExcel ( Команда )
	
	результат = получитьМакетExcel ();
	п = Новый Структура ();
	п.Вставить ( "Результат", результат );
	п.Вставить ( "Фильтр", "Microsoft Excel (*.xlsx)|*.xlsx" );
	п.Вставить ( "ТипФайла", ТипФайлаТабличногоДокумента.XLSX );
	РаботаСФайлами.СохранитьДокументВФайл ( п );
	
КонецПроцедуры

&НаСервере
Функция получитьМакетExcel ()
	
	Возврат ОбщийДокументы.ВывестиСписок ( Элементы.Список );
	
КонецФункции

&НаКлиенте
Процедура СписокПриАктивизацииСтроки ( Элемент )
	
	текущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ( текущиеДанные <> Неопределено ) Тогда
		Элементы.ПрикрепленныеФайлы.Заголовок = "Файлы" + ? ( текущиеДанные.КоличествоФайлов = 0, "", " (" + текущиеДанные.КоличествоФайлов + ")" );
	КонецЕсли; 
	
КонецПроцедуры