
Процедура ПередЗаписью ( Отказ, РежимЗаписи, РежимПроведения )
	
	Если ( ОбменДанными.Загрузка ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура заполнитьДополнительныеСвойства ()
	
	ДополнительныеСвойства.Вставить ( "Перепроведение", Проведен );
	ДополнительныеСвойства.Вставить ( "ОперативноеПроведение", ( ЭтоНовый () И НачалоДня ( Дата ) = НачалоДня ( ТекущаяДата () ) ) ); 
	
КонецПроцедуры 

Процедура ОбработкаПроведения ( Отказ, РежимПроведения )
	
	заполнитьДополнительныеСвойства	();
	данные = Новый Структура;
	данные.Вставить ( "Ссылка", Ссылка );
	данные.Вставить ( "Дата", Дата );
	данные.Вставить ( "Движения", Движения );
	данные.Вставить ( "МоментВремени", МоментВремени () );
	данные.Вставить ( "ДополнительныеСвойства", ДополнительныеСвойства );
	Отказ = НЕ Документы.ПлатежноеПоручениеВходящее.Проведение ( данные );
	
КонецПроцедуры

Процедура ОбработкаЗаполнения ( ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка )
	
	Если ТипЗнч ( ДанныеЗаполнения ) = Тип ( "ДокументСсылка.СчетНаОплату" ) Тогда
		заполнитьПоГТД ( ДанныеЗаполнения );
	КонецЕсли;
	
КонецПроцедуры

Процедура заполнитьПоГТД ( Данные )
	
	// шапка
	ГТД = Данные;
	с = "
	|выбрать
	|	Контрагент как Контрагент, Сумма как Сумма,
	| 	Организация как Организация, СуммаДоллар как СуммаДоллар,
	|	Ссылка как СчетНаОплату, НазначениеПлатежа как НазначениеПлатежа,
	|	представление ( Ссылка ) как ПредставлениеСчетНаОплату,
	|	ГТД как ГТД 
	|из
	|	Документ.СчетНаОплату
	|где
	|	Ссылка = &Данные  
	|";
	запрос = Новый Запрос ( с );
	запрос.УстановитьПараметр ( "Данные", Данные );
	результат = запрос.Выполнить ();
	выборка = результат.Выбрать ();
	выборка.Следующий ();
	Организация = выборка.Организация;
	Контрагент = выборка.Контрагент;
	Сумма = выборка.Сумма;
	СуммаДоллар = выборка.СуммаДоллар;
	СчетНаОплату = выборка.СчетНаОплату;
	ГТД = выборка.ГТД;
	НазначениеПлатежа = выборка.НазначениеПлатежа;
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Комментарий = "На основании счета на оплату - " + выборка.ПредставлениеСчетНаОплату;
	
КонецПроцедуры 