
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Ссылка = Параметры.Ссылка;
	Комментарий = Параметры.Комментарий;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК ( Команда )
	
	Если ( Модифицированность ) Тогда
		добавитьКомментарий ( Ссылка, Комментарий );	
	КонецЕсли; 
	Закрыть ( Комментарий );
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура добавитьКомментарий ( Ссылка, Комментарий )
	
	докОбъект = Ссылка.ПолучитьОбъект ();
	докОбъект.Комментарий = Комментарий;
	докОбъект.Записать ();
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении ( Элемент )
	
	Модифицированность = Истина;
	
КонецПроцедуры
