
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		ОбщийДокументы.НачальноеЗаполнение ( Объект );
		Объект.ВидОперации = Перечисления.ВидОперацииРасходныйКассовыйОрдер.Оплата;
	Иначе
		// код ...	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПлатежаПриИзменении ( Элемент )
	
	рассчитатьСумму ();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаКомиссииПриИзменении ( Элемент )
	
	рассчитатьСумму ();
	
КонецПроцедуры

&НаКлиенте
Процедура рассчитатьСумму ()
	
	Объект.Сумма = Объект.СуммаПлатежа + Объект.СуммаКомиссии;  
	
КонецПроцедуры 

&НаКлиенте
Процедура КонтрагентПриИзменении ( Элемент )
	
	Объект.Пост = ПолучитьГоловногоКонтрагента ( Объект.Контрагент );
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьГоловногоКонтрагента ( Контрагент )
	
	пост = Справочники.Контрагенты.ПустаяСсылка ();
	Если ( ЗначениеЗаполнено ( Контрагент ) ) Тогда
		пост = Контрагент.ГоловнойКонтрагент;
	КонецЕсли; 
	Возврат пост;

КонецФункции 

&НаКлиенте
Процедура ВидОперацииПриИзменении ( Элемент )
	
	установитьВидимостьСтраниц ();	
	
КонецПроцедуры

&НаКлиенте
Процедура установитьВидимостьСтраниц ()
	
	Если ( Объект.ВидОперации = ПредопределенноеЗначение ( "Перечисление.ВидОперацииРасходныйКассовыйОрдер.Оплата" ) ) Тогда
		Элементы.СтраницаОплатаКлиента.Видимость = ИСТИНА;
		Элементы.СтраницаВыдачаВПодотчет.Видимость = ЛОЖЬ;
		Элементы.СтраницаПрочее.Видимость = ЛОЖЬ;
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии ( Отказ )
	
	установитьВидимостьСтраниц ();
	
КонецПроцедуры