
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Если ( ЗначениеЗаполнено ( Параметры.Ключ ) ) Тогда
		// код ...
	Иначе
		заполнитьПоСрезуПоследних ();
	КонецЕсли; 	
	
КонецПроцедуры

&НаСервере
Процедура заполнитьПоСрезуПоследних ()
	
	Запись.Валюта = Справочники.Валюты.Доллар; 
	с = "
	|выбрать
	|	Курс как Курс, КурсКоммерческийПокупка как КурсКоммерческийПокупка,
	|	КурсКоммерческийПродажа как КурсКоммерческийПродажа
	|из
	|	РегистрСведений.КурсыВалют.СрезПоследних ( , Валюта = значение ( Справочник.Валюты.Доллар ) ) 
	|";
	запрос = Новый Запрос ( с );
	результат = запрос.Выполнить ();
	выборка = результат.Выбрать ();
	Пока ( выборка.Следующий () ) Цикл
		Запись.Курс = выборка.Курс;
		Запись.КурсКоммерческийПокупка = выборка.КурсКоммерческийПокупка;
		Запись.КурсКоммерческийПродажа = выборка.КурсКоммерческийПродажа;
	КонецЦикла; 
	
КонецПроцедуры 