
Процедура СчетНаОплату ( ТабДок, Ссылка) Экспорт
	
	макет = Документы.СчетНаОплату.Получитьмакет ( "СчетНаОплату" );
	с = "
	|выбрать
	|	ГТД как ГТД,
	|	Дата как Дата,
	|	Комментарий как Комментарий,
	|	Контрагент как Контрагент,
	|	НазначениеПлатежа как НазначениеПлатежа,
	|	Номер как Номер,
	|	Организация как Организация,
	|	Ответственный как Ответственный,
	|	Сумма как Сумма,
	|	СуммаДоллар как СуммаДоллар,
	|	Счет
	|из
	|	Документ.СчетНаОплату
	|где
	|	Ссылка = &Ссылка
	|";
	запрос = Новый Запрос ( с );
	запрос.Параметры.Вставить ( "Ссылка", Ссылка );
	выборка = запрос.Выполнить ().Выбрать ();
	заголовок = макет.ПолучитьОбласть ( "Заголовок" );
	шапка = макет.ПолучитьОбласть ( "Шапка" );
	ТабДок.Очистить ();
	Пока выборка.Следующий() Цикл
		ТабДок.Вывести ( заголовок );
		Шапка.Параметры.Заполнить ( выборка );
		ТабДок.Вывести ( шапка );
	КонецЦикла;
	
КонецПроцедуры