
Процедура ПередЗаписью ( Отказ, РежимЗаписи, РежимПроведения )
	
	Если ( ОбменДанными.Загрузка ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи ( Отказ )
	
	Если ( ОбменДанными.Загрузка ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения ( ДанныеЗаполнения, СтандартнаяОбработка ) Экспорт 
	
	Если ТипЗнч ( ДанныеЗаполнения ) = Тип ( "ДокументСсылка.ГТД" ) Тогда
		заполнитьПоГТД ( ДанныеЗаполнения );
	КонецЕсли;
	
КонецПроцедуры

Процедура заполнитьПоГТД ( Данные )
	
	// шапка
	ГТД = Данные;
	с = "
	|выбрать
	|	ДокГТД.Контрагент как Контрагент, 
	|	ДокГТД.СуммаГТД как Сумма,
	| 	ДокГТД.Организация как Организация,
	|	ДокГТД.СуммаИнвойса как СуммаДоллар,
	|	ДокГТД.Ссылка как ГТД,
	|	представление ( ДокГТД.Ссылка ) как ПредставлениеГТД,
	|	ДокГТД.Контроль как Контроль,
	|	сумма ( естьnull ( ДокБрокер.СуммаПоДокументуДоллар, 0 ) ) как СуммаПоДокументуДолларБрокер,
	|	сумма ( естьnull ( ДокЭкспедитор.СуммаПоДокументуДоллар, 0 ) ) как СуммаПоДокументуДолларЭкспедитор,
	|	сумма ( естьnull ( ДокКонтроль.СуммаЗабрали, 0 ) ) как СуммаЗабрали
	|из
	|	Документ.ГТД как ДокГТД
	|	левое соединение Документ.БрокерскиеУслуги как ДокБрокер
	|	по ДокБрокер.Контроль = ДокГТД.Контроль
	|		и ДокБрокер.Проведен 
	|	левое соединение Документ.ЭкспедиторскиеУслуги как ДокЭкспедитор
	|	по ДокЭкспедитор.Контроль = ДокГТД.Контроль
	|		и ДокЭкспедитор.Проведен 
	|	левое соединение Документ.Контроль как ДокКонтроль
	|	по ДокКонтроль.Ссылка = ДокГТД.Контроль
	|где
	|	ДокГТД.Ссылка = &Данные  
	|сгруппировать по
	|	ДокГТД.Контрагент, ДокГТД.СуммаГТД, ДокГТД.Организация,
	|	ДокГТД.СуммаИнвойса,
	|	ДокГТД.Ссылка, представление ( ДокГТД.Ссылка ),
	|	ДокГТД.Контроль	 
	|";
	запрос = Новый Запрос ( с );
	запрос.УстановитьПараметр ( "Данные", Данные );
	результат = запрос.Выполнить ();
	выборка = результат.Выбрать ();
	выборка.Следующий ();
	Организация = выборка.Организация;
	ГТД = выборка.ГТД;
	Контрагент = выборка.Контрагент;
	Сумма = 0; // выборка.Сумма;
	СуммаДоллар = ( выборка.СуммаПоДокументуДолларБрокер + выборка.СуммаПоДокументуДолларЭкспедитор + выборка.СуммаЗабрали );
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Комментарий = "На основании ГТД - " + выборка.ПредставлениеГТД;
	
КонецПроцедуры