
&НаКлиенте
Процедура КомандаОК ( Команда )
	
	п = Новый Структура ();
	п.Вставить ( "Контрагент", Контрагент );
	п.Вставить ( "СтатьяДДС", СтатьяДДС );
	п.Вставить ( "Валюта", Валюта );
	п.Вставить ( "Сумма", Сумма );
	п.Вставить ( "ДолгПоВалютам", ДолгПоВалютам );
	п.Вставить ( "СчетНаОплату", СчетНаОплату );
	м = Новый Массив ();
	Для Каждого строкаТЗ Из Оплаты Цикл
		м.Добавить ( Новый Структура ( "Валюта, Сумма, Курс", строкаТЗ.Валюта, строкаТЗ.Сумма, строкаТЗ.Курс ) );
	КонецЦикла; 
	п.Вставить ( "Оплаты", м );
	Закрыть ( п );
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыКурсПриИзменении ( Элемент )
	
	данные = Элементы.Оплаты.ТекущиеДанные;
	Если ( Валюта = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) ) Тогда
		Если ( данные.Валюта = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) ) Тогда
			данные.Сумма = Сумма * данные.Курс;
		КонецЕсли;
	ИначеЕсли ( Валюта = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) ) Тогда
		Если ( данные.Валюта = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) И данные.Курс <> 0 ) Тогда
			данные.Сумма = Сумма / данные.Курс;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыСуммаПриИзменении ( Элемент )
	
	данные = Элементы.Оплаты.ТекущиеДанные;
	Если ( данные.Курс = 0 ) Тогда
	КонецЕсли; 
	Если ( Валюта = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) ) Тогда
		Если ( данные.Валюта = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) ) Тогда
			Сумма = данные.Сумма / данные.Курс;
		КонецЕсли;
	ИначеЕсли ( Валюта = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) ) Тогда
		Если ( данные.Валюта = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) И данные.Курс <> 0 ) Тогда
			Сумма = данные.Сумма * данные.Курс;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении ( Элемент )
	
	Если ( Оплаты.Количество () > 0 ) Тогда
		данные = Оплаты [ 0 ];  
		Если ( Валюта = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) ) Тогда
			Если ( данные.Валюта = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) ) Тогда
				данные.Сумма = Сумма * данные.Курс;
			КонецЕсли;
		ИначеЕсли ( Валюта = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) ) Тогда
			Если ( данные.Валюта = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) И данные.Курс <> 0 ) Тогда
				данные.Сумма = Сумма / данные.Курс;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСчетуНаОплату ( Команда )
	
	Если ( ЗначениеЗаполнено ( СчетНаОплату ) ) Тогда
		заполнитьПоСчету ();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура заполнитьПоСчету ()
	
	данные = получитьРеквизитыСчетНаОплату ( СчетНаОплату );
	Контрагент = данные.Контрагент;
	Валюта = данные.Валюта;
	Сумма = данные.Сумма;		
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция получитьРеквизитыСчетНаОплату ( СчетНаОплату )
	
	с = "
	|выбрать
	|	Контрагент как Контрагент,
	|	выбор
	|		когда Сумма = 0
	|			тогда СуммаДоллар
	|		иначе
	|			Сумма
	|	конец как Сумма,
	|	выбор
	|		когда Сумма = 0
	|			тогда значение ( Справочник.Валюты.Доллар )
	|		иначе
	|			значение ( Справочник.Валюты.Гривна )
	|	конец как Валюта
	|из
	|	Документ.СчетНаОплату
	|где
	|	Ссылка = &СчетНаОплату  
	|";
	запрос = Новый Запрос ( с );
	запрос.УстановитьПараметр ( "СчетНаОплату", СчетНаОплату );
	результат = запрос.Выполнить ();
	выборка = результат.Выбрать ();
	выборка.Следующий ();
	п = Новый Структура ();
	п.Вставить ( "Контрагент", выборка.Контрагент );
	п.Вставить ( "Сумма", выборка.Сумма );
	п.Вставить ( "Валюта", выборка.Валюта );
	Возврат п;

КонецФункции 

&НаКлиенте
Процедура СчетНаОплатуПриИзменении ( Элемент )
	
	ПоказатьВопрос ( Новый ОписаниеОповещения ( "ВопросЗаполнить", ЭтотОбъект ), "Заполнить по счету?", РежимДиалогаВопрос.ДаНет ); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаполнить ( Ответ, Парамы ) Экспорт
	
	Если ( Ответ = КодВозвратаДиалога.Да ) Тогда
		заполнитьПоСчету ();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СчетНаОплатуНачалоВыбора ( Элемент, ДанныеВыбора, СтандартнаяОбработка )
	
	СтандартнаяОбработка = Ложь;
	п = Новый Структура ();
	отбор = Новый Структура ();
	отбор.Вставить ( "Оплачен", Ложь );
	п.Вставить ( "Отбор", отбор );
	ОткрытьФорму ( "Документ.СчетНаОплату.Форма.Выбор", п, Элемент, Новый УникальныйИдентификатор (), , , , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс );
	
КонецПроцедуры