
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		ОбщийДокументы.НачальноеЗаполнение ( Объект );
		Объект.ВидЗаявки = Справочники.ВидыЗаявок.Импорт;
		Объект.Валюта = Справочники.Валюты.Доллар; 
	Иначе
		установитьПараметрСписков ( Объект.Ссылка );	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортПриНачалеРедактирования ( Элемент, НоваяСтрока, Копирование )
	
	Если ( НоваяСтрока ) Тогда
		текущиеДанные = Элементы.Транспорт.ТекущиеДанные;
		текущиеДанные.ВидТранспорта = ПредопределенноеЗначение ( "Перечисление.ВидТранспорта.Контейнер" );
		текущиеДанные.ОбъемКонтейнера = ПредопределенноеЗначение ( "Перечисление.ОбъемКонтейнера.СорокФутов" );
		текущиеДанные.Контрагент = Объект.Контрагент;
		текущиеДанные.Организация = Объект.Организация;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере ( ТекущийОбъект, ПараметрыЗаписи )
	
	установитьПараметрСписков ( ТекущийОбъект.Ссылка );
	
КонецПроцедуры

&НаСервере
Процедура установитьПараметрСписков ( Заявка )
	
	БрокерскиеУслуги.Параметры.УстановитьЗначениеПараметра ( "Заявка", Заявка );
	ЭкспедиторскиеУслуги.Параметры.УстановитьЗначениеПараметра ( "Заявка", Заявка );	
	
КонецПроцедуры