
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		ОбщийДокументы.НачальноеЗаполнение ( Объект );
		// Объект.Счет = Объект.Организация.ОсновнойСчет;
	Иначе
		// код ...	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПлатежаПриИзменении ( Элемент )
	
	рассчитатьСумму ();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаКомиссииПриИзменении ( Элемент )
	
	рассчитатьСумму ();
	
КонецПроцедуры

&НаКлиенте
Процедура рассчитатьСумму ()
	
	Объект.Сумма = Объект.СуммаПлатежа + Объект.СуммаКомиссии;  
	
КонецПроцедуры 

&НаКлиенте
Процедура КонтрагентПриИзменении ( Элемент )
	
	Объект.Пост = ПолучитьГоловногоКонтрагента ( Объект.Контрагент );
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьГоловногоКонтрагента ( Контрагент )
	
	пост = Справочники.Контрагенты.ПустаяСсылка ();
	Если ( ЗначениеЗаполнено ( Контрагент ) ) Тогда
		пост = Контрагент.ГоловнойКонтрагент;
	КонецЕсли; 
	Возврат пост;

КонецФункции 
