
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Иначе
		// код ...	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстатки ( Команда )
	
	контрагент = ПредопределенноеЗначение ( "Справочник.Контрагенты.ПустаяСсылка" );
	ПоказатьВводЗначения ( Новый ОписаниеОповещения ( "ВыборКонтрагента", ЭтотОбъект ), контрагент, "Выбор контрагента:", Новый ОписаниеТипов ( "СправочникСсылка.Контрагенты" ) );
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКонтрагента ( Контрагент, Парам ) Экспорт
	
	Если ( ЗначениеЗаполнено ( Контрагент ) ) Тогда
		заполнитьОстаткиПоКонтрагенту ( Контрагент );
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура заполнитьОстаткиПоКонтрагенту ( Контрагент )
	
	Объект.Долги.Очистить (); 
	с = "
	|выбрать Заявка как Заявка, Контрагент как Контрагент, ВидОплаты как ВидОплаты, 
	|	Валюта как Валюта, Организация как Организация, СуммаОстаток как Сумма 
	|из РегистрНакопления.Взаиморасчеты.Остатки ( &Период, Контрагент = &Контрагент и Организация = &Организация )    
	|";
	запрос = Новый Запрос ( с );
	запрос.УстановитьПараметр ( "Период", ? ( Объект.Ссылка.Пустая (), ТекущаяДата (), Объект.Дата ) );
	запрос.УстановитьПараметр ( "Контрагент", Контрагент );
	запрос.УстановитьПараметр ( "Организация", Объект.Организация );
	результат = запрос.Выполнить ();
	выборка = результат.Выбрать ();
	Пока ( выборка.Следующий () ) Цикл
		новаяСтрока = Объект.Долги.Добавить ();
		ЗаполнитьЗначенияСвойств ( новаяСтрока, выборка );
		Если ( выборка.Сумма < 0 ) Тогда
			новаяСтрока.Сумма = - 1 * новаяСтрока.Сумма;
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры