
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	// код ... 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии ( Отказ )
	
	// код ...
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДокумент ( Команда )
	
	п = Новый Структура ( "Результат", Результат );
	п.Вставить ( "Результат", Результат );
	п.Вставить ( "Фильтр", "Microsoft Excel (*.xlsx)|*.xlsx" );
	п.Вставить ( "ТипФайла", ТипФайлаТабличногоДокумента.XLSX );
	РаботаСФайлами.СохранитьДокументВФайл ( п );	
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаЯчеек ( Команда )
	
	рассчитатьСуммуЯчеек ();
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриАктивизацииОбласти ( Элемент )
	
	рассчитатьСуммуЯчеек ();
	
КонецПроцедуры

&НаКлиенте
Процедура рассчитатьСуммуЯчеек ()
	
	сумма = 0;
	Для Каждого область Из Результат.ВыделенныеОбласти Цикл
		Если ТипЗнч ( область ) = Тип ( "ОбластьЯчеекТабличногоДокумента" ) Тогда
			Для индекс = область.Верх По область.Низ Цикл
				Для счетчик = область.Лево По область.Право Цикл
					Попытка
						числоВЯчейке = Число ( СтрЗаменить ( Результат.Область ( "R" + Формат ( индекс, "ЧГ=0" ) + "C" + Формат ( счетчик, "ЧГ=0" ) ).Текст, " ", "" ) );
					Исключение
						числоВЯчейке = 0;	
					КонецПопытки;
					сумма = сумма + числоВЯчейке;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Элементы.СуммаЯчеек.Заголовок = "  " + Формат ( сумма, "ЧДЦ=2; ЧН=0,00" );	
	
КонецПроцедуры