
Процедура ПередЗаписью ( Отказ, РежимЗаписи, РежимПроведения )
	
	Если ( ОбменДанными.Загрузка ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура заполнитьДополнительныеСвойства ()
	
	ДополнительныеСвойства.Вставить ( "Перепроведение", Проведен );
	ДополнительныеСвойства.Вставить ( "ОперативноеПроведение", ( ЭтоНовый () И НачалоДня ( Дата ) = НачалоДня ( ТекущаяДата () ) ) ); 
	
КонецПроцедуры 

Процедура ОбработкаПроведения ( Отказ, РежимПроведения )
	
	заполнитьДополнительныеСвойства	();
	данные = Новый Структура;
	данные.Вставить ( "Ссылка", Ссылка );
	данные.Вставить ( "Дата", Дата );
	данные.Вставить ( "Движения", Движения );
	данные.Вставить ( "МоментВремени", МоментВремени () );
	данные.Вставить ( "ДополнительныеСвойства", ДополнительныеСвойства );
	Отказ = НЕ Документы.АвансовыйОтчет.Проведение ( данные );
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения ( Отказ, ПроверяемыеРеквизиты )
	
	Если ( ВидОперации = Перечисления.ВидОперацииАвансовогоОтчета.ОтчетЗаТоварыУслуги ) Тогда
		_организация = ПроверяемыеРеквизиты.Найти ( "Организация" );
		Если ( ЗначениеЗаполнено ( _организация ) ) Тогда
			ПроверяемыеРеквизиты.Удалить ( _организация );			
		КонецЕсли;
		_касса = ПроверяемыеРеквизиты.Найти ( "Касса" );
		Если ( ЗначениеЗаполнено ( _касса ) ) Тогда
			ПроверяемыеРеквизиты.Удалить ( _касса );			
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры