
Функция Проведение ( Данные ) Экспорт
	
	получитьДанныеДокумента ( Данные );
	сформироватьВзаиморасчеты ( Данные );
	установитьФлагиЗаписи ( Данные );
	Возврат ИСТИНА;
	
КонецФункции

Процедура получитьДанныеДокумента ( Данные )
	
	текст = "
	|// ~Шапка
	|выбрать
	|	Ссылка.Дата как Период, Ссылка.Организация как Организация, Валюта как Валюта,
	|	Контрагент как Контрагент, Заявка как Заявка, ВидОплаты как ВидОплаты,
	|	Сумма как Сумма 
	|из Документ.КорректировкаДолга.Долги
	|где Ссылка = &Ссылка
	|";
	запрос = Новый Запрос ( текст );
	запрос.УстановитьПараметр ( "Ссылка", Данные.Ссылка );
	результат = запрос.Выполнить ();
	Данные.Вставить ( "Долги", запрос.Выполнить ().Выгрузить () );

КонецПроцедуры

Процедура сформироватьВзаиморасчеты ( Данные )
	
	Для Каждого строкаТЗ Из Данные.Долги Цикл
		движение = Данные.Движения.Взаиморасчеты.Добавить ();
		движение.Период = строкаТЗ.Период;
		движение.Заявка = строкаТЗ.Заявка;
		движение.Контрагент = строкаТЗ.Контрагент;
		движение.ВидОплаты = строкаТЗ.ВидОплаты;
		движение.Валюта = строкаТЗ.Валюта;
		движение.Организация = строкаТЗ.Организация;
		Если ( строкаТЗ.Сумма < 0 ) Тогда
			движение.Сумма = - 1 * строкаТЗ.Сумма;
			движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Иначе
			движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		    движение.Сумма = строкаТЗ.Сумма;
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

Процедура установитьФлагиЗаписи ( Данные )
	
	Данные.Движения.Взаиморасчеты.Записывать = ИСТИНА;
	
КонецПроцедуры