
&НаКлиенте
Процедура ОбработкаКоманды ( ПараметрКоманды, ПараметрыВыполненияКоманды )
	
	табДок = Новый ТабличныйДокумент;
	сформироватьТабДок ( ТабДок, ПараметрКоманды );
	п = Новый Структура ();
	п.Вставить ( "Результат", табДок );
	п.Вставить ( "Владелец", ПараметрКоманды );
	ОткрытьФорму ( "ОбщаяФорма.ФормаПечати", п, , Новый УникальныйИдентификатор () );
	
КонецПроцедуры

&НаСервере
Процедура сформироватьТабДок ( ТабДок, Ссылка )
	
	Документы.СчетНаОплату.СчетНаОплату ( ТабДок, Ссылка );
	
КонецПроцедуры