
&НаКлиенте
Процедура КомандаОК ( Команда )
	
	отказ = Ложь;
	Если ( ЗначениеЗаполнено ( ВалютаПриход ) ) Тогда
		// код ...	
	Иначе
		Сообщить ( "Не заполнено поле ""Валюта приход""!", СтатусСообщения.Важное );   
		отказ = Истина;
	КонецЕсли;
	Если ( ЗначениеЗаполнено ( ВалютаРасход ) ) Тогда
		// код ...	
	Иначе
		Сообщить ( "Не заполнено поле ""Валюта расход""!", СтатусСообщения.Важное );   
		отказ = Истина;
	КонецЕсли;
	Если ( отказ ) Тогда
		Возврат;
	КонецЕсли; 
	п = Новый Структура ();
	п.Вставить ( "ВалютаРасход", ВалютаРасход );
	п.Вставить ( "ВалютаПриход", ВалютаПриход );
	п.Вставить ( "Курс", Курс );
	п.Вставить ( "СуммаРасход", СуммаРасход );
	п.Вставить ( "СуммаПриход", СуммаПриход );
	Закрыть ( п );
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриходПриИзменении ( Элемент )
	
	Если ( ВалютаПриход = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) ) Тогда
		ВалютаРасход = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" );
	ИначеЕсли ( ВалютаПриход = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) ) Тогда
		ВалютаРасход = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" );
	ИначеЕсли ( ВалютаПриход = ПредопределенноеЗначение ( "Справочник.Валюты.Евро" ) ) Тогда
		ВалютаРасход = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" );
	КонецЕсли; 
	рассчитатьСуммаРасход ();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриходПриИзменении ( Элемент )
	
	рассчитатьСуммаРасход ();
	
КонецПроцедуры

&НаКлиенте
Процедура КурсПриИзменении ( Элемент )
	
	рассчитатьСуммаРасход ();
	
КонецПроцедуры

&НаКлиенте
Процедура рассчитатьСуммаРасход ()
	
	Если ( Курс <> 0 ) Тогда
		Если ( ВалютаПриход = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) ) Тогда
			СуммаРасход = СуммаПриход / Курс;			
		ИначеЕсли ( ВалютаПриход = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) ) Тогда
			СуммаРасход = СуммаПриход * Курс;			
		ИначеЕсли ( ВалютаПриход = ПредопределенноеЗначение ( "Справочник.Валюты.Евро" ) ) Тогда
			СуммаРасход = СуммаПриход * Курс;			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ВалютаРасходПриИзменении ( Элемент )
	
	Если ( ВалютаРасход = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) ) Тогда
		ВалютаПриход = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" );
	ИначеЕсли ( ВалютаРасход = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) ) Тогда
		ВалютаПриход = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" );
	ИначеЕсли ( ВалютаРасход = ПредопределенноеЗначение ( "Справочник.Валюты.Евро" ) ) Тогда
		ВалютаПриход = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" );
	КонецЕсли;
	рассчитатьСуммаПриход ();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаРасходПриИзменении ( Элемент )
	
	рассчитатьСуммаПриход ();
	
КонецПроцедуры

&НаКлиенте
Процедура рассчитатьСуммаПриход ()
	
	Если ( Курс <> 0 ) Тогда
		Если ( ВалютаРасход = ПредопределенноеЗначение ( "Справочник.Валюты.Гривна" ) ) Тогда
			СуммаПриход = СуммаРасход / Курс;			
		ИначеЕсли ( ВалютаРасход = ПредопределенноеЗначение ( "Справочник.Валюты.Доллар" ) ) Тогда
			СуммаПриход = СуммаРасход * Курс;			
		ИначеЕсли ( ВалютаРасход = ПредопределенноеЗначение ( "Справочник.Валюты.Евро" ) ) Тогда
			СуммаПриход = СуммаРасход * Курс;			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
