
#Область Проведение

Функция Проведение ( Данные ) Экспорт
	
	Возврат Истина;
	
КонецФункции 

Процедура ОбработкаПолученияПолейПредставления ( Поля, СтандартнаяОбработка )
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить ( "НомерГТД" );
	Поля.Добавить ( "Дата" );
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления ( Данные, Представление, СтандартнаяОбработка )
	
	СтандартнаяОбработка = Ложь;
	Представление = "ГТД № " + Данные.НомерГТД + " от " + Формат ( Данные.Дата, "ДФ=dd.MM.yyyy" );
	
КонецПроцедуры

#КонецОбласти