
Процедура ПередЗаписью ( Отказ, РежимЗаписи, РежимПроведения )
	
	Если ( ОбменДанными.Загрузка ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура заполнитьДополнительныеСвойства ()
	
	ДополнительныеСвойства.Вставить ( "Перепроведение", Проведен );
	ДополнительныеСвойства.Вставить ( "ОперативноеПроведение", ( ЭтоНовый () И НачалоДня ( Дата ) = НачалоДня ( ТекущаяДата () ) ) ); 
	
КонецПроцедуры 

Процедура ОбработкаПроведения ( Отказ, РежимПроведения )
	
	заполнитьДополнительныеСвойства	();
	данные = Новый Структура;
	данные.Вставить ( "Ссылка", Ссылка );
	данные.Вставить ( "Дата", Дата );
	данные.Вставить ( "Движения", Движения );
	данные.Вставить ( "МоментВремени", МоментВремени () );
	данные.Вставить ( "ДополнительныеСвойства", ДополнительныеСвойства );
	Отказ = НЕ Документы.ГТД.Проведение ( данные );
	
КонецПроцедуры

Процедура ОбработкаЗаполнения ( ДанныеЗаполнения, СтандартнаяОбработка )
	
	Если ТипЗнч ( ДанныеЗаполнения ) = Тип ( "Массив" ) Тогда
		заполнитьПоКонтролю ( ДанныеЗаполнения );
	КонецЕсли;
	
КонецПроцедуры

Процедура заполнитьПоКонтролю ( Данные )
	
	с = "
	|выбрать
	|	Дата как Дата,
	|	Контрагент как Контрагент,
	|	Транспорт как Транспорт,
	|	Номенклатура как Номенклатура,
	|	Ссылка как Контроль 
	|из
	|	Документ.Контроль
	|где
	|	Ссылка в ( &МассивКонтроль )
	|";
	запрос = Новый Запрос ( с );
	запрос.УстановитьПараметр ( "МассивКонтроль", Данные );
	результат = запрос.Выполнить ();
	выборка = результат.Выбрать ();
	Пока выборка.Следующий () Цикл
		Дата = выборка.Дата;
		новая = Транспорт.Добавить ();
		ЗаполнитьЗначенияСвойств ( новая, выборка ); 
	КонецЦикла;
	
КонецПроцедуры