Функция Проведение ( Данные ) Экспорт
	
	получитьДанныеДокумента ( Данные );
	записатьКурс ( Данные );
	Возврат ИСТИНА;
	
КонецФункции

Процедура получитьДанныеДокумента ( Данные )
	
	текст = "
	|// ~Шапка
	|выбрать
	|	Дата как Период, ВалютаИз как ВалютаИз, ВалютаВ как ВалютаВ,
	|	Сумма как Сумма, СуммаПоКурсу как СуммаПоКурсу, Курс как Курс
	|из Документ.ОбменВалюты
	|где Ссылка = &Ссылка
	|;
	|выбрать
	|	Курс как Курс, КурсКоммерческийПокупка как КурсКоммерческийПокупка,
	|	КурсКоммерческийПродажа как КурсКоммерческийПродажа
	|из
	|	РегистрСведений.КурсыВалют.СрезПоследних ( &Дата, Валюта = значение ( Справочник.Валюты.Доллар ) )  
	|";
	запрос = Новый Запрос ( текст );
	запрос.УстановитьПараметр ( "Ссылка", Данные.Ссылка );
	запрос.УстановитьПараметр ( "Дата", Данные.Дата );
	результат = запрос.ВыполнитьПакет ();
	выборкаШапка = результат [ 0 ].Выбрать ();
	выборкаШапка.Следующий ();
	Данные.Вставить ( "Шапка", выборкаШапка );
	выборкаКурсы = результат [ 1 ].Выбрать ();
	выборкаКурсы.Следующий ();
	Данные.Вставить ( "Курсы", выборкаКурсы );

КонецПроцедуры

Процедура записатьКурс ( Данные )
	
	Если ( Данные.Шапка.ВалютаИз = Данные.Шапка.ВалютаВ ) Тогда
		Возврат;
	КонецЕсли; 
	набор = РегистрыСведений.КурсыВалют.СоздатьНаборЗаписей ();
	набор.Отбор.Валюта.Установить ( Справочники.Валюты.Доллар );
	набор.Отбор.Период.Установить ( Данные.Шапка.Период );
	набор.Прочитать ();
	Если ( набор.Количество () = 0 ) Тогда
		новыйКурс = набор.Добавить ();
		новыйКурс.Период = Данные.Шапка.Период;
		новыйКурс.Валюта = Справочники.Валюты.Доллар;
		новыйКурс.Курс = Данные.Курсы.Курс;
		Если ( Данные.Шапка.ВалютаИз = Справочники.Валюты.Гривна ) Тогда // обмен грн.-> доллар
			новыйКурс.КурсКоммерческийПокупка = Данные.Шапка.Курс;
			новыйКурс.КурсКоммерческийПродажа = Данные.Курсы.КурсКоммерческийПродажа;
		Иначе // обмен доллар -> грн.
			новыйКурс.КурсКоммерческийПокупка = Данные.Курсы.КурсКоммерческийПокупка;;
			новыйКурс.КурсКоммерческийПродажа = Данные.Шапка.Курс;
		КонецЕсли; 
	Иначе
		курс = набор [ 0 ];
		Если ( Данные.Шапка.ВалютаИз = Справочники.Валюты.Гривна ) Тогда // обмен грн.-> доллар
			курс.КурсКоммерческийПокупка = Данные.Шапка.Курс;
			курс.КурсКоммерческийПродажа = Данные.Курсы.КурсКоммерческийПродажа;
		Иначе // обмен доллар -> грн.
			курс.КурсКоммерческийПокупка = Данные.Курсы.КурсКоммерческийПокупка;;
			курс.КурсКоммерческийПродажа = Данные.Шапка.Курс;
		КонецЕсли;
	КонецЕсли; 
	набор.Записать ();	
	
КонецПроцедуры