
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Результат = Параметры.Результат;
	Владелец = Параметры.Владелец;
	установитьПараметрыРезультата ();	
	
КонецПроцедуры

&НаСервере 
Процедура установитьПараметрыРезультата ()
	
	Результат.ОтображатьСетку = Ложь;
	Результат.Защита = Ложь;
	Результат.ТолькоПросмотр = Ложь;
	Результат.ОтображатьЗаголовки = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДокумент ( Команда )
	
	п = Новый Структура ( "Результат", Результат );
	п.Вставить ( "Результат", Результат );
	п.Вставить ( "Фильтр", "Microsoft Excel (*.xlsx)|*.xlsx" );
	п.Вставить ( "ТипФайла", ТипФайлаТабличногоДокумента.XLSX );
	РаботаСФайлами.СохранитьДокументВФайл ( п );	
	
КонецПроцедуры