
Процедура ПередЗаписью ( Отказ, РежимЗаписи, РежимПроведения )
	
	Если ( ОбменДанными.Загрузка ) Тогда
		Возврат;
	КонецЕсли;
	Если ( ПометкаУдаления ) Тогда
		РегистрыСведений.ПорядокДокументовКонтроль.УдалитьЗаписи ( Ссылка );
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриЗаписи ( Отказ )
	
	Если ( ОбменДанными.Загрузка ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура заполнитьДополнительныеСвойства ()
	
	ДополнительныеСвойства.Вставить ( "Перепроведение", Проведен );
	ДополнительныеСвойства.Вставить ( "ОперативноеПроведение", ( ЭтоНовый () И НачалоДня ( Дата ) = НачалоДня ( ТекущаяДата () ) ) ); 
	
КонецПроцедуры 

Процедура ОбработкаПроведения ( Отказ, РежимПроведения )
	
	заполнитьДополнительныеСвойства	();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения ( ДанныеЗаполнения, СтандартнаяОбработка ) Экспорт 
	
	Если ТипЗнч ( ДанныеЗаполнения ) = Тип ( "ДокументСсылка.ЗапросКлиента" ) Тогда
		заполнитьПоЗапросКлиента ( ДанныеЗаполнения );
	КонецЕсли;
	
КонецПроцедуры

Процедура заполнитьПоЗапросКлиента ( Данные )
	
	ЗапросКлиента = Данные.Ссылка;
	с = "
	|выбрать
	|	Контрагент как Контрагент,
	| 	Организация как Организация,
	|	ПакингЛист как ПакингЛист,
	|	Количество как Количество,
	|	Порт как Порт 
	|из
	|	Документ.ЗапросКлиента
	|где
	|	Ссылка = &Ссылка  
	|";
	запрос = Новый Запрос ( с );
	запрос.УстановитьПараметр ( "Ссылка", Данные.Ссылка );
	результат = запрос.Выполнить ();
	выборка = результат.Выбрать ();
	Пока ( выборка.Следующий () ) Цикл
		Контрагент = выборка.Контрагент;
		Организация = выборка.Организация;
		ПакингЛист = выборка.ПакингЛист;
		ВесПЛ = выборка.Количество;
		Порт = выборка.Порт;
	КонецЦикла; 
	
КонецПроцедуры
