
//Процедура ПриКомпоновкеРезультата ( ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка )
//	
//	СтандартнаяОбработка = Ложь;
//	сформироватьРезультат ( ДокументРезультат, ДанныеРасшифровки );
//	
//КонецПроцедуры

//Процедура сформироватьРезультат ( ДокументРезультат, ДанныеРасшифровки ) Экспорт
//	
//	СхемаКомпоновки = ПолучитьМакет ( "ОсновнаяСхемаКомпоновкиДанных" );
//	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
//	текущиеНастройки = КомпоновщикНастроек.ПолучитьНастройки ();
//	МакетКомпоновки = КомпоновщикМакета.Выполнить ( СхемаКомпоновкиДанных, текущиеНастройки, ДанныеРасшифровки, ,  );
//	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
//	ПроцессорКомпоновкиДанных.Инициализировать ( МакетКомпоновки, , ДанныеРасшифровки );
//	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
//	ПроцессорВывода.УстановитьДокумент ( ДокументРезультат ) ;
//	ПроцессорВывода.Вывести ( ПроцессорКомпоновкиДанных, Истина );

//КонецПроцедуры