
&НаКлиенте
Процедура ИзменитьСтатус ( Команда )
	
	Перем статус;
	м = Элементы.Список.ВыделенныеСтроки;
	Если ( м.Количество () > 0 ) Тогда
		массивДокументов = получитьМассивДокументов ( м );
		п = Новый Структура ();
		п.Вставить ( "МассивДокументов", массивДокументов );
		ПоказатьВводЗначения ( Новый ОписаниеОповещения ( "ВыборСтатуса", ЭтотОбъект, п ), статус, "Выберите статус:", Тип ( "ПеречислениеСсылка.СтатусыКонтроль" ) );   
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция получитьМассивДокументов ( ВыделенныеСтроки )
	
	м = Новый Массив ();
	Для Каждого строкаСписка Из ВыделенныеСтроки Цикл
		м.Добавить ( строкаСписка );
	КонецЦикла; 
	Возврат м;
	
КонецФункции

&НаКлиенте
Процедура ВыборСтатуса ( ВыбранноеЗначение, Парамы ) Экспорт
	
	Если ( ВыбранноеЗначение = Неопределено ) Тогда
		Возврат;
	КонецЕсли;
	изменитьСтатусСервер ( Парамы.МассивДокументов, ВыбранноеЗначение );
	Элементы.Список.Обновить ();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура изменитьСтатусСервер ( МассивДокументов, Статус )
	
	Для Каждого док Из МассивДокументов Цикл
		докОбъект = док.ПолучитьОбъект ();
		докОбъект.Статус = Статус;
		докОбъект.Записать ();		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьГТД(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры
